# PANDAS

In [4]:
import pandas as pd

In [2]:
city1=pd.Series([12,6,-8,-3])

# city

In [3]:
city1

0    12
1     6
2    -8
3    -3
dtype: int64

In [4]:
city1.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
city2=pd.Series([12,-6,8,-3],index=['day1', 'day2','day3','day4'])

In [6]:
city2

day1    12
day2    -6
day3     8
day4    -3
dtype: int64

In [7]:
city2.day3

8

to get data on rows corresponding index number

In [8]:
city2[['day4','day2']]

day4   -3
day2   -6
dtype: int64

to get the data which is of particular condition (boolean value)

In [9]:
city2<0

day1    False
day2     True
day3    False
day4     True
dtype: bool

In [10]:
city2[city2<0]

day2   -6
day4   -3
dtype: int64

In [11]:
city2.min()

-6

In [12]:
city2.mean()

2.75

In [13]:
city2.median()

2.5

In [14]:
city2.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, day1 to day4
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [15]:
city2*2

day1    24
day2   -12
day3    16
day4    -6
dtype: int64

In [16]:
population=pd.Series([19,45,3,18,88])

In [17]:
states=['KL','TN','AP','TS','KA']

In [18]:
population.index=states

In [19]:
population

KL    19
TN    45
AP     3
TS    18
KA    88
dtype: int64

In [20]:
states={'year':[2001,2002,2003,2004,2005,20006],
       's_name':['KL','TN','TK','TS','AP','MH'],
       'pop':[35,70,80,4,45,100]}

In [21]:
states

{'year': [2001, 2002, 2003, 2004, 2005, 20006],
 's_name': ['KL', 'TN', 'TK', 'TS', 'AP', 'MH'],
 'pop': [35, 70, 80, 4, 45, 100]}

In [22]:
df_pop=pd.DataFrame(states)

In [23]:
df_pop

    year s_name  pop
0   2001     KL   35
1   2002     TN   70
2   2003     TK   80
3   2004     TS    4
4   2005     AP   45
5  20006     MH  100

In [24]:
df_pop['pop']

0     35
1     70
2     80
3      4
4     45
5    100
Name: pop, dtype: int64

In [28]:
df_pop1=pd.DataFrame(df_pop,columns=['year','s_name','pop','income'])

In [29]:
df_pop1

    year s_name  pop  income
0   2001     KL   35     NaN
1   2002     TN   70     NaN
2   2003     TK   80     NaN
3   2004     TS    4     NaN
4   2005     AP   45     NaN
5  20006     MH  100     NaN

In [5]:
df_auto=pd.read_csv(r'C:\Users\user\Downloads\auto-mpg.csv')

In [6]:
df_auto

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [7]:
df_auto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    int64
 8   car name      398 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

In [9]:
df_auto.shape

(398, 9)

In [10]:
df_auto.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model year', 'origin', 'car name'],
      dtype='object')

In [11]:
df_auto.isna()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
393,False,False,False,False,False,False,False,False,False
394,False,False,False,False,False,False,False,False,False
395,False,False,False,False,False,False,False,False,False
396,False,False,False,False,False,False,False,False,False
397,False,False,False,False,False,False,False,False,False

In [12]:
df_auto.isna().sum()

mpg             0
cylinders       0
displacement    0
horsepower      0
weight          0
acceleration    0
model year      0
origin          0
car name        0
dtype: int64

In [13]:
df_auto.nunique()

mpg             129
cylinders         5
displacement     82
horsepower       94
weight          351
acceleration     95
model year       13
origin            3
car name        305
dtype: int64

In [14]:
df_auto['horsepower'].nunique()

94

In [15]:
df_auto['origin'].value_counts()

origin
1    249
3     79
2     70
Name: count, dtype: int64

In [16]:
df_auto['cylinders'].value_counts()

cylinders
4    204
8    103
6     84
3      4
5      3
Name: count, dtype: int64

In [17]:
df_auto['mpg'].mean()

23.514572864321607

In [19]:
df_auto.groupby('origin')['mpg'].mean()

origin
1    20.083534
2    27.891429
3    30.450633
Name: mpg, dtype: float64

In [20]:
df_auto.groupby('cylinders')['mpg'].mean()

cylinders
3    20.550000
4    29.286765
5    27.366667
6    19.985714
8    14.963107
Name: mpg, dtype: float64

In [22]:
df_auto.groupby('cylinders')[['mpg','displacement']].mean()

                 mpg  displacement
cylinders
3          20.550000     72.500000
4          29.286765    109.796569
5          27.366667    145.000000
6          19.985714    218.142857
8          14.963107    345.009709

In [23]:
df_auto.groupby('cylinders').agg({'mpg':'mean'})

                 mpg
cylinders
3          20.550000
4          29.286765
5          27.366667
6          19.985714
8          14.963107

In [27]:
df_auto.groupby('cylinders').agg({'mpg':'mean','displacement':'median'})

                 mpg  displacement
cylinders
3          20.550000          70.0
4          29.286765         105.0
5          27.366667         131.0
6          19.985714         228.0
8          14.963107         350.0

In [28]:
df_auto.groupby('cylinders').agg({'mpg':'mean'})

0      18.0
1      15.0
2      18.0
3      16.0
4      17.0
       ...
393    27.0
394    44.0
395    32.0
396    28.0
397    31.0
Name: mpg, Length: 398, dtype: float64

In [29]:
df_auto.groupby('cylinders').agg({'mpg':'mean'})

      mpg  displacement
0    18.0         307.0
1    15.0         350.0
2    18.0         318.0
3    16.0         304.0
4    17.0         302.0
..    ...           ...
393  27.0         140.0
394  44.0          97.0
395  32.0         135.0
396  28.0         120.0
397  31.0         119.0

[398 rows x 2 columns]

In [30]:
df_auto.groupby('cylinders').agg({'mpg':'mean'}).head()

                 mpg
cylinders
3          20.550000
4          29.286765
5          27.366667
6          19.985714
8          14.963107

In [32]:
df_auto.groupby('cylinders').agg({'mpg':'mean'}).tail()

90

In [37]:
df_auto.iloc[:,[1,4]].tail()

     cylinders  weight
393          4    2790
394          4    2130
395          4    2295
396          4    2625
397          4    2720

In [40]:
df_auto.iloc[1:100,:4]

     mpg  cylinders  displacement horsepower
1   15.0          8         350.0        165
2   18.0          8         318.0        150
3   16.0          8         304.0        150
4   17.0          8         302.0        140
5   15.0          8         429.0        198
..   ...        ...           ...        ...
95  12.0          8         455.0        225
96  13.0          8         360.0        175
97  18.0          6         225.0        105
98  16.0          6         250.0        100
99  18.0          6         232.0        100

[99 rows x 4 columns]